//====================================================================================
// 구조체명 : Opcode
// 목적 코드(명령어)를 수행합니다.
//====================================================================================
typedef enum codes {    // 명령어 코드
    lit, opr, lod, sto, cal, ret, ict, jmp, jpc
} Opcode;

//====================================================================================
// 함수명 : execute
// 목적 코드(명령어)를 수행합니다.
//====================================================================================
typedef enum ops {      // 연산 명령 코드
    neg, add, sub, mul, div, odd, eq, ls, gr,
    neq, lseq, greq, wrt, wrl
} Operator;

void execute();