#include "getSource.h"

#ifndef TBL
#define TBL
#include "table.h"
#endif
#include "codegen.h"

#define MINERROR 3
#define FIRSTADDR 2

static Token token;

//====================================================================================
// 블록 컴파일
//====================================================================================
static void block       (int pIndex);  

//====================================================================================
// 상수 선언 컴파일
//====================================================================================
static void constDecl   (void);

//====================================================================================
// 변수 선언 컴파일
//====================================================================================
static void varDecl     (void);

//====================================================================================
// 함수 선언 컴파일
//====================================================================================
static void funcDecl    (void);

//====================================================================================
// 문장 컴파일
//====================================================================================
static void statement   (void);

//====================================================================================
//식 컴파일
//====================================================================================
static void expression  (void);

//====================================================================================
// 식의 항 컴파일
//====================================================================================
static void term        (void);

//====================================================================================
// 식의 인자 컴파일
//====================================================================================
static void factor      (void);

//====================================================================================
// 조건식 컴파일
//====================================================================================
static void condition   (void);

//====================================================================================
// 인자로 들어온 토큰 t는 문장 맨 앞의 키인가?
//====================================================================================
static int  isStBeginKey(Token t);

//====================================================================================
// 함수명 : compile
// 
//====================================================================================
int compile()
{
    int i = 0;

    printf("start compilation\n");
    initSource();           //getSource 초기설정
    token = nextToken();    //첫 토큰
    blockBegin(FIRSTADDR);  //이후 선언은 새로운 블록 
    block(0);               //0은 dummy              //정의 안되어있음
    finalSource();                                   //정의 안되어있음
    i = errorN();           //오류 메세지 개수
    if (i != 0) {
        printf("%d errors\n", i);
    }
    //listCode();           //.o 코드 출력(필요한 경우)

    return i < MINERROR;    //오류 메세지의 개수가 적은지 확인
}


//====================================================================================
// 함수명 : block
// 인자   : pIndex , 해당 블록 함수 이름의 인덱스
//====================================================================================
void block(int pIndex)          
{
    int backP;
    
    backP = genCodeV(jmp, 0);  //내부 함수를 점프하는 명령, 이후에 백패치

    while(1) {
        switch(token.kind) {
            case Const  :  token = nextToken(); constDecl(); continue;
            case Var    :  token = nextToken(); varDecl();   continue;
            case Func   :  token = nextToken(); funcDecl();  continue;
            default : break;
        }
        break;
    }
    backPatch(backP);             // 내부 함수를 점프하는 명령으로 패치
    changeV(pIndex, nextCode());  // 그 함수의 시작 주소를 수정
    genCodeV(ict, frameL());      // 그 블록의 실행 때에 필요한 기억 영역을 잡는 명령
    statement();                  // 그 블록의 메인 문장
    genCodeR();                   // 리턴 명령
    blockEnd();                   // 블록이 끝났다는 것을 table에 전달
}

void finalSource()
{

}

//====================================================================================
// 함수명 : constDecl
// 상수 선언 컴파일
//====================================================================================
void constDecl()
{
    Token temp;

    while (1) {
        if(token.kind == Id) {
            setIdKind(constId); // 출력을 위한 정보 설정
            temp = token;       // 이름을 넣어 둠
            token = checkGet(nextToken(), Equal); //이름 다음은 무조건 '='
            if(token.kind == Num) {
                enterTconst(temp.u.id, token.u.value); //상수 이름과 값을 테이블에 저장
            } else {
                errorType("number"); 
            }
            token = nextToken();
        } else {
            errorMissingId();
        }

        if(token.kind != Comma) { // 토큰의 종류가 ','라면 상수 선언이 이어짐.
            if(token.kind == Id) { // 다음이 이름이라면 쉼표를 잊었다는 의미.
                errorInsert(Comma);
                continue;
            } else {
                break;
            }
        }
        token = nextToken();
    }

    token = checkGet(token, Semicolon); // 마지막은 ";"
}

//====================================================================================
// 함수명 : varDecl
// 변수 선언 컴파일
//====================================================================================
void varDecl()
{
    while(1) {
        if(token.kind == Id) {

        }
        else {
            errorMissingId();
        }

        if(token.kind != Comma) {
            if(token.kind == Id) {
                errorInsert(Comma);
                continue;
            }
            else {
                break;
            }
        }
        token = nextToken();
    }
    token = checkGet(token, Semicolon);
}

void funcDecl()
{

}
